# git init-> превращает текущую директорию в git репозиторий (создается .git)
# git add . ->(.->все файлы,можно указать отдельные файлы) ->отслеживание всех файлов
# git commit -m "commit" -> добавляет/совершает сохранение в git всех файлов,которые находятся в индексе
# git log ->выводит журнал (log) сохранений
# git status -> показывает статус файлов
# git remote add origin(название связи-обычно origin) SSH(ссылка на удаленный репозиторий)
# git checkout hash_commit -> просматриваем версию
# git branch -> выводит в терминал список всех веток(звездочкой помечена активная ветка) 
# git checkout <название_ветки> 
#                               -переход на указанную ветку
# git switch <название_ветки>
# git push origin(название_связи) master(название_ветки) -> отправка версии кода на удаленный репозиторий 
# git clone <ссылка_на_удаленный_репозиторий> -> склонировать/скопировать/скачать репозиторий


# hello


# test